Repository: GkhKaya/EvdeSaglik
Catalog: EvdeSaglik/Utils/Localizables/*.lproj/Localizable.strings
Languages: tr

# HomeSolution.InputPlaceholder
source: e.g., my shin hurts a lot (kaval kemiğim çok fazla ağrıyor)
tr: örn: kaval kemiğim çok fazla ağrıyor (my shin hurts a lot)

# HomeSolution.Submit
source: What can I do at home?
tr: Evde ne yapabilirim?

# HomeSolution.SystemPersona
source: You are a medical assistant giving safe at-home recommendations. Provide steps strictly in this order: 1) Physical movements/exercises and posture changes, 2) Natural methods (e.g., warm water, salt water gargle, herbal teas), 3) Over-the-counter medicine suggestions (with generic names), and finally 4) A short warning on when to see a doctor if symptoms persist or worsen.
tr: Sen güvenli evde bakım önerileri veren bir asistansın. Adımları şu sırada ver: 1) Fiziksel hareketler/egzersiz ve duruş değişiklikleri, 2) Doğal yöntemler (örn. ılık su, tuzlu su gargarası, bitki çayları), 3) Reçetesiz ilaç önerileri (jenerik isimle), ve en sonda 4) Belirtiler sürerse/kötüleşirse ne zaman doktora gidilmeli uyarısı.

# HomeSolution.SystemFormat
source: Return clear, numbered steps in Turkish. Avoid JSON. Keep each step concise and actionable.
tr: Türkçe, numaralı ve net adımlar ver. JSON kullanma. Her adım kısa ve uygulanabilir olsun.

# HomeSolution.DefaultUserPrompt
source: General home care tips for common minor complaints.
tr: Yaygın hafif şikayetler için genel evde bakım önerileri.

# HomeSolution.UserPrompt
source: Complaint: %@
tr: Şikayet: %@

# HomeSolution.Save
source: Save to History
tr: Geçmişe Kaydet

# HomeSolution.SaveSuccess
source: Saved successfully
tr: Başarıyla kaydedildi

# HomeSolution.SaveError
source: Save failed
tr: Kaydetme başarısız

# LabResult.Title
source: Lab Test Results
tr: Laboratuvar Sonuçları

# LabResult.Subtitle
source: Upload your lab results PDF and get AI analysis with recommendations.
tr: Laboratuvar sonuçlarınızın PDF'ini yükleyin ve AI analizi ile öneriler alın.

# LabResult.Warning
source: Important Notice
tr: Önemli Uyarı

# LabResult.WarningText
source: These recommendations are for informational purposes only. Always consult your doctor for proper medical advice and treatment.
tr: Bu öneriler sadece bilgilendirme amaçlıdır. Doğru tıbbi tavsiye ve tedavi için mutlaka doktorunuza danışın.

# LabResult.UploadPDF
source: Upload Lab Results PDF
tr: Laboratuvar Sonuçları PDF'i Yükle

# LabResult.UploadDescription
source: Select your lab test results PDF file
tr: Laboratuvar test sonuçlarınızın PDF dosyasını seçin

# LabResult.PDFSelected
source: PDF Selected
tr: PDF Seçildi

# LabResult.Pages
source: pages
tr: sayfa

# LabResult.TablesExtracted
source: Tables extracted successfully
tr: Tablolar başarıyla çıkarıldı

# LabResult.Analyze
source: Analyze Results
tr: Sonuçları Analiz Et

# LabResult.Save
source: Save to History
tr: Geçmişe Kaydet

# LabResult.SaveSuccess
source: Saved successfully
tr: Başarıyla kaydedildi

# LabResult.SaveError
source: Save failed
tr: Kaydetme başarısız

# LabResult.SystemPersona
source: You are a medical lab results analyst. Analyze the provided lab test results and identify any abnormal values. Provide recommendations in this order: 1) Abnormal values and their potential causes, 2) Natural solutions and lifestyle changes, 3) Medication suggestions (generic names), 4) Clear warning about consulting a doctor.
tr: Sen bir tıbbi laboratuvar sonuçları analizcisisin. Verilen laboratuvar test sonuçlarını analiz et ve anormal değerleri belirle. Önerileri şu sırada ver: 1) Anormal değerler ve potansiyel nedenleri, 2) Doğal çözümler ve yaşam tarzı değişiklikleri, 3) İlaç önerileri (jenerik isimler), 4) Doktora danışma konusunda net uyarı.

# LabResult.SystemFormat
source: Provide clear, numbered analysis in the device language. Avoid JSON. Keep recommendations concise and actionable.
tr: Cihaz dilinde net, numaralı analiz ver. JSON kullanma. Önerileri kısa ve uygulanabilir tut.

# LabResult.UserPrompt
source: Lab Results Data: %@
tr: Laboratuvar Sonuçları Verisi: %@

# NaturalSolutions.Title
source: Natural Solutions
tr: Doğal Çözümler

# NaturalSolutions.Subtitle
source: Describe your health concern and get natural remedy suggestions.
tr: Sağlık sorununuzu açıklayın ve doğal çözüm önerileri alın.

# NaturalSolutions.InputTitle
source: Your Health Concern
tr: Sağlık Sorununuz

# NaturalSolutions.InputPlaceholder
source: e.g., headache, insomnia, digestive issues
tr: örn: baş ağrısı, uykusuzluk, sindirim sorunları

# NaturalSolutions.Submit
source: Find Natural Solutions
tr: Doğal Çözümleri Bul

# NaturalSolutions.Save
source: Save to History
tr: Geçmişe Kaydet

# NaturalSolutions.SaveSuccess
source: Saved successfully
tr: Başarıyla kaydedildi

# NaturalSolutions.SaveError
source: Save failed
tr: Kaydetme başarısız

# NaturalSolutions.SystemPersona
source: You are a natural health consultant. Provide natural remedy suggestions for the user's health concern. Include both well-known traditional remedies and lesser-known but effective natural solutions. Focus on herbs, foods, lifestyle changes, and natural therapies.
tr: Sen bir doğal sağlık danışmanısın. Kullanıcının sağlık sorunu için doğal çözüm önerileri sun. Hem bilinen geleneksel çözümleri hem de az bilinen ama etkili doğal çözümleri dahil et. Otlar, besinler, yaşam tarzı değişiklikleri ve doğal terapiler üzerine odaklan.

# NaturalSolutions.SystemFormat
source: Provide clear, numbered natural solutions in the device language. Avoid JSON. Include both common and uncommon remedies. Keep suggestions practical and safe.
tr: Cihaz dilinde net, numaralı doğal çözümler ver. JSON kullanma. Hem yaygın hem de az bilinen çözümleri dahil et. Önerileri pratik ve güvenli tut.

# NaturalSolutions.DefaultUserPrompt
source: General natural health tips for common concerns.
tr: Yaygın sorunlar için genel doğal sağlık ipuçları.

# NaturalSolutions.UserPrompt
source: Health concern: %@
tr: Sağlık sorunu: %@

# NaturalSolutions.Concern.Headache
source: Headache
tr: Baş Ağrısı

# NaturalSolutions.Concern.Insomnia
source: Insomnia
tr: Uykusuzluk

# NaturalSolutions.Concern.Digestive
source: Digestive Issues
tr: Sindirim Sorunları

# NaturalSolutions.Concern.Stress
source: Stress
tr: Stres

# NaturalSolutions.Concern.Cold
source: Cold/Flu
tr: Soğuk Algınlığı

# NaturalSolutions.Concern.Fatigue
source: Fatigue
tr: Halsizlik

# NaturalSolutions.Concern.Skin
source: Skin Problems
tr: Cilt Sorunları

# NaturalSolutions.Concern.JointPain
source: Joint Pain
tr: Eklem Ağrısı

# NaturalSolutions.Other
source: Other
tr: Diğer

# NaturalSolutions.OtherTitle
source: Other Concerns
tr: Diğer Sorunlar

# NaturalSolutions.OtherPlaceholder
source: Describe other health concerns...
tr: Diğer sağlık sorunlarınızı açıklayın...

# NaturalSolutions.FeelingsTitle
source: How do you feel?
tr: Nasıl hissediyorsunuz?

# NaturalSolutions.FeelingsPlaceholder
source: Describe your feelings briefly
tr: Kısaca hissiyatınızı yazın

# NaturalSolutions.UserConcerns
source: Selected concerns: %@
tr: Seçilen sorunlar: %@

# NaturalSolutions.UserOtherConcerns
source: Additional concerns: %@
tr: Ek sorunlar: %@

# NaturalSolutions.UserFeelings
source: User feelings: %@
tr: Kullanıcı hissiyatı: %@

# Profile.Title
source: Profile
tr: Profil

# Profile.UserName
source: User
tr: Kullanıcı

# Profile.Section.AccountInfo
source: Account Information
tr: Hesap Bilgileri

# Profile.Section.Personalization
source: Personalization
tr: Kişiselleştirme

# Profile.Section.DepartmentSuggestions
source: Department Suggestions
tr: Doktor Önerileri

# Profile.Section.DiseasePredictions
source: Disease Predictions
tr: Hastalık Tahminleri

# Profile.Section.HomeSolutions
source: Home Solutions
tr: Ev Çözümleri

# Profile.Section.LabResults
source: Lab Results
tr: Laboratuvar Sonuçları

# Profile.Section.NaturalSolutions
source: Natural Solutions
tr: Doğal Çözümler

# Profile.Section.AccountSettings
source: Account Settings
tr: Hesap Ayarları

# Profile.Item.Email
source: Email
tr: E-posta

# Profile.Item.Password
source: Password
tr: Şifre

# Profile.Item.Personalize
source: Personalize Profile
tr: Profili Kişiselleştir

# Profile.Item.ViewHistory
source: View History
tr: Geçmişi Görüntüle

# Profile.Item.ResetData
source: Reset All Data
tr: Tüm Verileri Sıfırla

# Profile.Item.DeleteAccount
source: Delete Account
tr: Hesabı Sil

# Profile.Item.PasswordValue
source: Change password
tr: Şifreyi değiştir

# Profile.Item.PersonalizeValue
source: Update your health profile
tr: Sağlık profilinizi güncelleyin

# Profile.Item.ViewHistoryValue
source: View saved results
tr: Kaydedilen sonuçları görüntüle

# Profile.Item.ResetDataValue
source: Delete all saved data
tr: Tüm kaydedilen verileri sil

# Profile.Item.DeleteAccountValue
source: Permanently delete account
tr: Hesabı kalıcı olarak sil

# Profile.ChangeEmail.Title
source: Change Email
tr: E-posta Değiştir

# Profile.ChangeEmail.Description
source: Enter your new email address. You will need to verify it.
tr: Yeni e-posta adresinizi girin. Doğrulamanız gerekecek.

# Profile.ChangeEmail.NewEmail
source: New Email
tr: Yeni E-posta

# Profile.ChangeEmail.Placeholder
source: Enter new email address
tr: Yeni e-posta adresini girin

# Profile.ChangeEmail.Update
source: Update Email
tr: E-postayı Güncelle

# Profile.ChangePassword.Title
source: Change Password
tr: Şifre Değiştir

# Profile.ChangePassword.Description
source: Enter your current password and choose a new one.
tr: Mevcut şifrenizi girin ve yeni bir şifre seçin.

# Profile.ChangePassword.Current
source: Current Password
tr: Mevcut Şifre

# Profile.ChangePassword.New
source: New Password
tr: Yeni Şifre

# Profile.ChangePassword.Confirm
source: Confirm New Password
tr: Yeni Şifreyi Onayla

# Profile.ChangePassword.CurrentPlaceholder
source: Enter current password
tr: Mevcut şifrenizi girin

# Profile.ChangePassword.NewPlaceholder
source: Enter new password
tr: Yeni şifrenizi girin

# Profile.ChangePassword.ConfirmPlaceholder
source: Confirm new password
tr: Yeni şifreyi onaylayın

# Profile.ChangePassword.Update
source: Update Password
tr: Şifreyi Güncelle

# Profile.Alert.Error
source: Error
tr: Hata

# Profile.Alert.Success
source: Success
tr: Başarılı

# Profile.Alert.ResetData
source: Reset All Data
tr: Tüm Verileri Sıfırla

# Profile.Alert.DeleteAccount
source: Delete Account
tr: Hesabı Sil

# Profile.Alert.ResetDataMessage
source: This will permanently delete all your saved data. This action cannot be undone.
tr: Bu işlem tüm kaydedilen verilerinizi kalıcı olarak silecek. Bu işlem geri alınamaz.

# Profile.Alert.DeleteAccountMessage
source: This will permanently delete your account and all data. This action cannot be undone.
tr: Bu işlem hesabınızı ve tüm verilerinizi kalıcı olarak silecek. Bu işlem geri alınamaz.

# Profile.Action.Cancel
source: Cancel
tr: İptal

# Profile.Action.Reset
source: Reset
tr: Sıfırla

# Profile.Action.Delete
source: Delete
tr: Sil

# Profile.Error.EmptyEmail
source: Please enter an email address
tr: Lütfen bir e-posta adresi girin

# Profile.Error.InvalidEmail
source: Please enter a valid email address
tr: Lütfen geçerli bir e-posta adresi girin

# Profile.Error.EmptyFields
source: Please fill in all fields
tr: Lütfen tüm alanları doldurun

# Profile.Error.PasswordMismatch
source: New passwords do not match
tr: Yeni şifreler eşleşmiyor

# Profile.Error.WeakPassword
source: Password must be at least 6 characters
tr: Şifre en az 6 karakter olmalı

# Profile.Success.EmailChanged
source: Email updated successfully
tr: E-posta başarıyla güncellendi

# Profile.Success.PasswordChanged
source: Password updated successfully
tr: Şifre başarıyla güncellendi

# Profile.Success.DataReset
source: All data has been reset
tr: Tüm veriler sıfırlandı

# Profile.Success.AccountDeleted
source: Account deleted successfully
tr: Hesap başarıyla silindi

# Profile.Item.DepartmentHistory
source: View Doctor Suggestions
tr: Aldığın Doktor Önerilerini Görüntüle

# Profile.Item.DepartmentHistoryValue
source: See which doctors were recommended
tr: Hangi doktorların önerildiğini gör

# Profile.Item.DiseaseHistory
source: View Disease Predictions
tr: Hastalık Tahminlerini Görüntüle

# Profile.Item.DiseaseHistoryValue
source: See predicted diseases
tr: Tahmin edilen hastalıkları gör

# Profile.Item.HomeHistory
source: View Home Solutions
tr: Ev Çözümlerini Görüntüle

# Profile.Item.HomeHistoryValue
source: See home remedy suggestions
tr: Ev çözümü önerilerini gör

# Profile.Item.LabHistory
source: View Lab Results
tr: Laboratuvar Sonuçlarını Görüntüle

# Profile.Item.LabHistoryValue
source: See lab result analyses
tr: Lab sonuç analizlerini gör

# Profile.Item.NaturalHistory
source: View Natural Solutions
tr: Doğal Çözümleri Görüntüle

# Profile.Item.NaturalHistoryValue
source: See natural remedy suggestions
tr: Doğal çözüm önerilerini gör

# DepartmentHistory.Title
source: Doctor Suggestions
tr: Doktor Önerileri

# DepartmentHistory.Empty.Title
source: No Doctor Suggestions Yet
tr: Henüz Doktor Önerisi Yok

# DepartmentHistory.Empty.Description
source: Your doctor suggestions will appear here after you use the 'Which Doctor Should I Go To?' feature.
tr: Doktor önerileriniz 'Hangi Doktora Gitmeliyim?' özelliğini kullandıktan sonra burada görünecek.

# DepartmentHistory.Card.Date
source: Date:
tr: Tarih:

# DepartmentHistory.Card.Symptoms
source: Symptoms:
tr: Belirtiler:

# DepartmentHistory.Card.Suggestions
source: Recommended Doctors:
tr: Önerilen Doktorlar:

# DiseaseHistory.Title
source: Disease Predictions
tr: Hastalık Tahminleri

# DiseaseHistory.Empty.Title
source: No Disease Predictions Yet
tr: Henüz Hastalık Tahmini Yok

# DiseaseHistory.Empty.Description
source: Your disease predictions will appear here after you use the 'What Could Be My Disease?' feature.
tr: Hastalık tahminleriniz 'Hastalığım Ne Olabilir?' özelliğini kullandıktan sonra burada görünecek.

# DiseaseHistory.Card.Date
source: Date:
tr: Tarih:

# DiseaseHistory.Card.Symptoms
source: Symptoms:
tr: Belirtiler:

# DiseaseHistory.Card.Predictions
source: Predicted Diseases:
tr: Tahmin Edilen Hastalıklar:

# HomeHistory.Title
source: Home Solutions
tr: Ev Çözümleri

# HomeHistory.Empty.Title
source: No Home Solutions Yet
tr: Henüz Ev Çözümü Yok

# HomeHistory.Empty.Description
source: Your home solutions will appear here after you use the 'What Can I Do at Home?' feature.
tr: Ev çözümleriniz 'Evde Ne Yapabilirim?' özelliğini kullandıktan sonra burada görünecek.

# HomeHistory.Card.Date
source: Date:
tr: Tarih:

# HomeHistory.Card.Symptom
source: Symptom:
tr: Belirti:

# HomeHistory.Card.Solutions
source: Solutions:
tr: Çözümler:

# LabHistory.Title
source: Lab Results
tr: Laboratuvar Sonuçları

# LabHistory.Empty.Title
source: No Lab Results Yet
tr: Henüz Lab Sonucu Yok

# LabHistory.Empty.Description
source: Your lab result analyses will appear here after you use the 'Lab Test Results' feature.
tr: Lab sonuç analizleriniz 'Laboratuvar Sonuçları' özelliğini kullandıktan sonra burada görünecek.

# LabHistory.Card.Date
source: Date:
tr: Tarih:

# LabHistory.Card.Results
source: Lab Results:
tr: Lab Sonuçları:

# LabHistory.Card.Medications
source: Suggested Medications:
tr: Önerilen İlaçlar:

# LabHistory.Card.NaturalSolutions
source: Natural Solutions:
tr: Doğal Çözümler:

# NaturalHistory.Title
source: Natural Solutions
tr: Doğal Çözümler

# NaturalHistory.Empty.Title
source: No Natural Solutions Yet
tr: Henüz Doğal Çözüm Yok

# NaturalHistory.Empty.Description
source: Your natural solutions will appear here after you use the 'Natural Solutions' feature.
tr: Doğal çözümleriniz 'Doğal Çözümler' özelliğini kullandıktan sonra burada görünecek.

# NaturalHistory.Card.Date
source: Date:
tr: Tarih:

# NaturalHistory.Card.Question
source: Question:
tr: Soru:

# NaturalHistory.Card.Remedies
source: Natural Remedies:
tr: Doğal Çözümler:
