Repository: GkhKaya/EvdeSaglik
Catalog: EvdeSaglik/Utils/Localizables/*.lproj/Localizable.strings
Languages: tr

# Auth.Error.RegistrationFailed
source: Registration failed: %@
tr: Kayıt işlemi başarısız oldu: %@

# Auth.Error.LoginFailed
source: Login failed: %@
tr: Giriş işlemi başarısız oldu: %@

# Auth.Error.PasswordResetFailed
source: Password reset failed: %@
tr: Şifre sıfırlama işlemi başarısız oldu: %@

# Auth.Error.EmailUpdateFailed
source: Email update failed: %@
tr: E-posta güncelleme işlemi başarısız oldu: %@

# Auth.Error.Unknown
source: An unknown authentication error occurred.
tr: Bilinmeyen bir kimlik doğrulama hatası oluştu.

# Firestore.Error.ReadFailed
source: Data read failed: %@
tr: Veri okuma başarısız oldu: %@

# Firestore.Error.WriteFailed
source: Data write failed: %@
tr: Veri yazma başarısız oldu: %@

# Firestore.Error.DocumentNotFound
source: Document not found: %@
tr: Doküman bulunamadı: %@

# Firestore.Error.NetworkError
source: Network error occurred: %@
tr: Ağ hatası oluştu: %@

# Firestore.Error.Unknown
source: An unknown Firestore error occurred.
tr: Bilinmeyen bir Firestore hatası oluştu.

# Register.Title
source: Create Account
tr: Hesap Oluştur

# Register.Subtitle
source: Create your account to start your healthy living journey.
tr: Sağlıklı yaşam yolculuğunuza başlamak için hesabınızı oluşturun.

# Register.Email.Label
source: Email Address
tr: E-posta Adresi

# Register.Email.Placeholder
source: example@email.com
tr: ornek@email.com

# Register.Password.Label
source: Password
tr: Şifre

# Register.Password.Placeholder
source: Enter your password
tr: Şifrenizi girin

# Register.ConfirmPassword.Label
source: Confirm Password
tr: Şifre Tekrar

# Register.ConfirmPassword.Placeholder
source: Re-enter your password
tr: Şifrenizi tekrar girin

# Register.Button
source: Create Account
tr: Hesap Oluştur

# Register.Login.Prefix
source: Already have an account?
tr: Zaten hesabınız var mı?

# Register.Login.Link
source: Sign in
tr: Giriş yapın

# Register.Error.InvalidForm
source: Please fill in all fields correctly.
tr: Lütfen tüm alanları doğru şekilde doldurun.

# Register.Error.EmailAlreadyInUse
source: This email address is already in use.
tr: Bu e-posta adresi zaten kullanılıyor.

# Register.Error.InvalidEmail
source: Invalid email address.
tr: Geçersiz e-posta adresi.

# Register.Error.WeakPassword
source: Password must be at least 6 characters.
tr: Şifre en az 6 karakter olmalıdır.

# Register.Error.Generic
source: An error occurred while creating your account. Please try again.
tr: Hesap oluşturulurken bir hata oluştu. Lütfen tekrar deneyin.

# Register.EmailHint.Invalid
source: Please enter a valid email address.
tr: Lütfen geçerli bir e-posta adresi giriniz.

# Register.PasswordHint.MinLength
source: Min 8 characters
tr: En az 8 karakter

# Register.PasswordHint.Uppercase
source: Uppercase letter
tr: Büyük harf

# Register.PasswordHint.Lowercase
source: Lowercase letter
tr: Küçük harf

# Register.PasswordHint.Number
source: A number
tr: Sayı

# Register.PasswordHint.SpecialCharacter
source: A special character
tr: Özel karakter

# Password.Strength.Weak
source: Weak
tr: Zayıf

# Password.Strength.Medium
source: Medium
tr: Orta

# Password.Strength.Strong
source: Strong
tr: Güçlü

# Password.Strength.VeryStrong
source: Very Strong
tr: Çok Güçlü

# Login.Title
source: Manage Your Health from Home
tr: Sağlığınızı Evinizden Yönetin

# Login.Subtitle
source: Welcome to your AI-powered personal health assistant
tr: AI destekli kişisel sağlık asistanınıza hoş geldiniz

# Login.Email.Label
source: Email
tr: E-posta

# Login.Email.Placeholder
source: health@email.com
tr: sağlık@email.com

# Login.Password.Label
source: Password
tr: Şifre

# Login.Password.Placeholder
source: Your secure password
tr: Güvenli şifreniz

# Login.ForgotPassword
source: Forgot password
tr: Şifremi unuttum

# Login.SignIn
source: Sign In
tr: Giriş Yap

# Login.SignUp.Title
source: Don't have an account?
tr: Hesabınız yok mu?

# Login.SignUp.Action
source: Sign up now
tr: Hemen kayıt olun

# Login.Validation.Invalid
source: Please enter a valid email and password.
tr: Lütfen geçerli bir e‑posta ve şifre giriniz.

# Login.Or
source: or
tr: veya

# Login.Continue.Apple
source: Continue with Apple
tr: Apple ile devam et

# Login.Continue.Google
source: Continue with Google
tr: Google ile devam et

# Login.Benefits.Title
source: Why Evde Sağlık?
tr: Neden Evde Sağlık?

# Login.Benefits.AI
source: AI-powered disease prediction
tr: Yapay zeka destekli hastalık tahmini

# Login.Benefits.Home
source: Home-applicable solutions
tr: Eve uygulanabilir çözümler

# Login.Benefits.Lab
source: Lab result analysis
tr: Laboratuvar sonuç analizi

# Login.RememberMe
source: Remember me
tr: Beni hatırla

# Login.ForgotPassword.InvalidEmail
source: Please enter a valid email address for password reset.
tr: Şifre sıfırlama için lütfen geçerli bir e-posta adresi giriniz.

# Login.ForgotPassword.Success
source: Password reset link has been sent to your email address.
tr: Şifre sıfırlama bağlantısı e-posta adresinize gönderildi.

# Login.Error.Generic
source: An error occurred during login. Please try again.
tr: Giriş yaparken bir hata oluştu. Lütfen tekrar deneyin.

# Onboarding.Back
source: Back
tr: Geri

# Onboarding.Next
source: Continue
tr: Devam Et

# Onboarding.Skip
source: Skip
tr: Atla

# Onboarding.Finish
source: Finish
tr: Bitir

# Onboarding.Update
source: Update Profile
tr: Profili Güncelle

# Onboarding.Intro.Title
source: Personal Assistant for Your Health
tr: Sağlığınız için Kişisel Asistan

# Onboarding.Intro.Description
source: This information will be used to provide you with personalized health recommendations. You can skip this step and complete it later if you prefer.
tr: Bu bilgiler size özel sağlık önerileri sunmak için kullanılacaktır. Dilerseniz bu adımı atlayıp daha sonra tamamlayabilirsiniz.

# Onboarding.BasicInfo.Title
source: Basic Information
tr: Temel Bilgiler

# Onboarding.BasicInfo.Description
source: We'd like to know some basic information about you to serve you better.
tr: Size daha iyi hizmet verebilmek için hakkınızda bazı temel bilgiler edinmek istiyoruz.

# Onboarding.BasicInfo.Name
source: Full Name
tr: Ad Soyad

# Onboarding.BasicInfo.NamePlaceholder
source: Your first and last name
tr: Adınız ve Soyadınız

# Onboarding.BasicInfo.Gender
source: Gender
tr: Cinsiyet

# Onboarding.BasicInfo.Gender.Male
source: Male
tr: Erkek

# Onboarding.BasicInfo.Gender.Female
source: Female
tr: Kadın

# Onboarding.BasicInfo.Gender.Other
source: Other
tr: Diğer

# Onboarding.BasicInfo.Age
source: Age
tr: Yaş

# Onboarding.BasicInfo.AgeSelect
source: Select your age
tr: Yaşınızı seçin

# Onboarding.HealthInfo.Title
source: Health Status
tr: Sağlık Durumu

# Onboarding.HealthInfo.Description
source: Tell us about your current health status so we can provide the most suitable recommendations.
tr: Size en uygun önerileri sunabilmemiz için mevcut sağlık durumunuz hakkında bilgi verin.

# Onboarding.HealthInfo.ChronicDiseases
source: Your Chronic Diseases
tr: Kronik Hastalıklarınız

# Onboarding.HealthInfo.ChronicDiseases.Diabetes
source: Diabetes
tr: Diyabet

# Onboarding.HealthInfo.ChronicDiseases.Hypertension
source: Hypertension
tr: Hipertansiyon

# Onboarding.HealthInfo.ChronicDiseases.Asthma
source: Asthma
tr: Astım

# Onboarding.HealthInfo.ChronicDiseases.HeartDisease
source: Heart Disease
tr: Kalp Hastalığı

# Onboarding.HealthInfo.ChronicDiseases.KidneyDisease
source: Kidney Disease
tr: Böbrek Hastalığı

# Onboarding.HealthInfo.ChronicDiseases.LiverDisease
source: Liver Disease
tr: Karaciğer Hastalığı

# Onboarding.HealthInfo.ChronicDiseases.Thyroid
source: Thyroid
tr: Tiroid

# Onboarding.HealthInfo.ChronicDiseases.None
source: None
tr: Yok

# Onboarding.HealthInfo.Allergies
source: Your Allergies
tr: Alerjileriniz

# Onboarding.HealthInfo.Allergies.Medication
source: Medication Allergy
tr: İlaç Alerjisi

# Onboarding.HealthInfo.Allergies.Food
source: Food Allergy
tr: Besin Alerjisi

# Onboarding.HealthInfo.Allergies.Pollen
source: Pollen Allergy
tr: Polen Alerjisi

# Onboarding.HealthInfo.Allergies.Animal
source: Animal Allergy
tr: Hayvan Alerjisi

# Onboarding.HealthInfo.Allergies.Dust
source: Dust Allergy
tr: Toz Alerjisi

# Onboarding.HealthInfo.Allergies.Other
source: Other
tr: Diğer

# Onboarding.HealthInfo.Allergies.Unknown
source: Unknown
tr: Bilmiyorum

# Onboarding.HealthInfo.Allergies.None
source: None
tr: Yok

# Onboarding.HealthInfo.Medications
source: Medications You Use Regularly
tr: Düzenli Kullandığınız İlaçlar

# Onboarding.HealthInfo.Medications.BloodPressure
source: Blood Pressure Medication
tr: Tansiyon İlacı

# Onboarding.HealthInfo.Medications.Diabetes
source: Diabetes Medication
tr: Diyabet İlacı

# Onboarding.HealthInfo.Medications.Heart
source: Heart Medication
tr: Kalp İlacı

# Onboarding.HealthInfo.Medications.Painkiller
source: Painkiller
tr: Ağrı Kesici

# Onboarding.HealthInfo.Medications.Antidepressant
source: Antidepressant
tr: Antidepresan

# Onboarding.HealthInfo.Medications.Other
source: Other
tr: Diğer

# Onboarding.HealthInfo.Medications.None
source: None
tr: Yok

# Onboarding.Lifestyle.Title
source: Lifestyle
tr: Yaşam Tarzı

# Onboarding.Lifestyle.Description
source: Tell us about your lifestyle so we can provide appropriate recommendations.
tr: Yaşam tarzın hakkında bilgi ver ki sana uygun öneriler sunabilelim.

# Onboarding.Lifestyle.Sleep
source: Your Sleep Pattern
tr: Uyku Düzeniniz

# Onboarding.Lifestyle.SleepDescription
source: Evaluate your overall sleep quality and routine
tr: Genel uyku kalitenizi ve düzeninizi değerlendirin

# Onboarding.Lifestyle.Sleep.Good
source: Good
tr: İyi

# Onboarding.Lifestyle.Sleep.GoodDescription
source: Regular sleep hours and quality sleep
tr: Düzenli uyku saatleri ve kaliteli uyku

# Onboarding.Lifestyle.Sleep.GoodExample
source: Example: I sleep 7-9 hours a day, go to bed at 11 PM and wake up at 7 AM
tr: Örnek: Günde 7-9 saat uyuyorum, gece 23:00'da yatıp sabah 07:00'de kalkıyorum

# Onboarding.Lifestyle.Sleep.Medium
source: Medium
tr: Orta

# Onboarding.Lifestyle.Sleep.MediumDescription
source: Sometimes irregularities occur
tr: Bazen düzensizlik yaşanıyor

# Onboarding.Lifestyle.Sleep.MediumExample
source: Example: I sleep 5-7 hours a day, my sleep hours vary
tr: Örnek: Günde 5-7 saat uyuyorum, uyku saatlerim değişken

# Onboarding.Lifestyle.Sleep.Bad
source: Bad
tr: Kötü

# Onboarding.Lifestyle.Sleep.BadDescription
source: Irregular sleep and insufficient rest
tr: Düzensiz uyku ve yetersiz dinlenme

# Onboarding.Lifestyle.Sleep.BadExample
source: Example: I sleep less than 5 hours a day, I am constantly sleepless
tr: Örnek: Günde 5 saatten az uyuyorum, sürekli uykusuzum

# Onboarding.Lifestyle.Activity
source: Your Physical Activity Level
tr: Fiziksel Aktivite Düzeyiniz

# Onboarding.Lifestyle.ActivityDescription
source: Specify your daily physical activity level
tr: Günlük fiziksel aktivite seviyenizi belirtin

# Onboarding.Lifestyle.Activity.Low
source: Low
tr: Düşük

# Onboarding.Lifestyle.Activity.LowDescription
source: Sedentary lifestyle
tr: Hareketsiz yaşam tarzı

# Onboarding.Lifestyle.Activity.LowExample
source: Example: I take light walks 1-2 days a week, mostly work at a desk
tr: Örnek: Haftada 1-2 gün hafif yürüyüş, çoğunlukla masa başında çalışıyorum

# Onboarding.Lifestyle.Activity.Medium
source: Medium
tr: Orta

# Onboarding.Lifestyle.Activity.MediumDescription
source: Regular physical activity
tr: Düzenli fiziksel aktivite

# Onboarding.Lifestyle.Activity.MediumExample
source: Example: I walk or exercise for 30 minutes 3-4 days a week
tr: Örnek: Haftada 3-4 gün 30 dakika yürüyüş veya spor yapıyorum

# Onboarding.Lifestyle.Activity.High
source: High
tr: Yüksek

# Onboarding.Lifestyle.Activity.HighDescription
source: Active lifestyle and regular exercise
tr: Aktif yaşam tarzı ve düzenli spor

# Onboarding.Lifestyle.Activity.HighExample
source: Example: I exercise 5+ days a week, take 10,000+ steps daily
tr: Örnek: Haftada 5+ gün spor yapıyorum, günlük 10.000+ adım atıyorum

# Onboarding.Lifestyle.Nutrition
source: Your Nutrition Habits
tr: Beslenme Alışkanlıklarınız

# Onboarding.Lifestyle.NutritionDescription
source: Evaluate your eating habits and preferences
tr: Beslenme düzeninizi ve tercihlerinizi değerlendirin

# Onboarding.Lifestyle.Nutrition.Bad
source: Bad
tr: Kötü

# Onboarding.Lifestyle.Nutrition.BadDescription
source: Irregular eating and unhealthy choices
tr: Düzensiz beslenme ve sağlıksız tercihler

# Onboarding.Lifestyle.Nutrition.BadExample
source: Example: Mostly fast food, sugary drinks, irregular meal times
tr: Örnek: Çoğunlukla fast food, şekerli içecekler, düzensiz öğün saatleri

# Onboarding.Lifestyle.Nutrition.Medium
source: Medium
tr: Orta

# Onboarding.Lifestyle.Nutrition.MediumDescription
source: Mixed eating habits
tr: Karma beslenme alışkanlıkları

# Onboarding.Lifestyle.Nutrition.MediumExample
source: Example: Sometimes home-cooked meals, sometimes out, vegetable/fruit consumption varies
tr: Örnek: Bazen ev yemeği bazen dışarıda, sebze-meyve tüketimi değişken

# Onboarding.Lifestyle.Nutrition.Good
source: Good
tr: İyi

# Onboarding.Lifestyle.Nutrition.GoodDescription
source: Balanced and healthy eating
tr: Dengeli ve sağlıklı beslenme

# Onboarding.Lifestyle.Nutrition.GoodExample
source: Example: Regular meals, 5 servings of fruits/vegetables daily, drink plenty of water
tr: Örnek: Düzenli öğünler, günde 5 porsiyon sebze-meyve, bol su içerim

# Onboarding.CustomOption
source: Other
tr: Diğer

# Onboarding.CustomOptionPlaceholder
source: Write your own...
tr: Kendiniz yazın...

# Onboarding.Add
source: Add
tr: Ekle

# Onboarding.Cancel
source: Cancel
tr: İptal

# Onboarding.Summary.Title
source: Summary
tr: Özet

# Onboarding.Summary.Description
source: Here's a summary of the information you provided. If everything looks correct, you can finish.
tr: Girdiğin bilgilerin özeti aşağıda. Her şey doğruysa bitirebilirsin.

# Onboarding.Summary.BasicInfo
source: Basic Information
tr: Temel Bilgiler

# Onboarding.Summary.HealthInfo
source: Health Information
tr: Sağlık Bilgileri

# Onboarding.Summary.Lifestyle
source: Lifestyle
tr: Yaşam Tarzı

# Onboarding.Summary.ChronicDiseases
source: Chronic Diseases
tr: Kronik Hastalıklar

# Onboarding.Summary.Allergies
source: Allergies
tr: Alerjiler

# Onboarding.Summary.Sleep
source: Sleep
tr: Uyku

# Onboarding.Summary.Activity
source: Activity
tr: Aktivite

# Onboarding.Summary.Nutrition
source: Nutrition
tr: Beslenme

# MainApp.Title
source: Welcome to Main App!
tr: Ana Uygulamaya Hoş Geldiniz!

# MainApp.LogoutButton
source: Log Out
tr: Çıkış Yap

# MainApp.SearchBar.Title
source: How can we help you?
tr: Size nasıl yardımcı olabiliriz?

# MainApp.SearchBar.Placeholder
source: Ask a health question...
tr: Sağlıkla ilgili bir soru sorun...

# MainApp.PersonalizeButton
source: Personalize
tr: Kişiselleştir

# MainApp.PersonalizeSheet.Title
source: Personalization Settings
tr: Kişiselleştirme Ayarları

# MainApp.Card.Doctor
source: Which doctor should I go to?
tr: Hangi doktora gitmeliyim?

# MainApp.Card.Disease
source: What could be my disease?
tr: Hastalığım ne olabilir?

# MainApp.Card.HomeRemedies
source: What can I do at home?
tr: Evde ne yapabilirim?

# MainApp.Card.LabResults
source: Lab test results
tr: Kan tahlili sonuçları

# MainApp.Card.NaturalSolutions
source: Natural solutions
tr: Doğal çözümler

# MainApp.Card.SkinProblems
source: Skin problems
tr: Cilt problemleri

# UserManager.NoUserInformation
source: No user information available for personalization.
tr: Kişiselleştirme için kullanıcı bilgisi mevcut değil.

# UserManager.Prompt.FullName
source: User's full name: %@
tr: Kullanıcının tam adı: %@

# UserManager.Prompt.Age
source: Age: %d
tr: Yaş: %d

# UserManager.Prompt.Gender
source: Gender: %@
tr: Cinsiyet: %@

# UserManager.Prompt.ChronicDiseases
source: Chronic diseases: %@
tr: Kronik hastalıklar: %@

# UserManager.Prompt.Allergies
source: Allergies: %@
tr: Alerjiler: %@

# UserManager.Prompt.Medications
source: Regular medications: %@
tr: Düzenli kullanılan ilaçlar: %@

# UserManager.Prompt.SleepPattern
source: Sleep pattern: %@
tr: Uyku düzeni: %@

# UserManager.Prompt.PhysicalActivity
source: Physical activity: %@
tr: Fiziksel aktivite: %@

# UserManager.Prompt.NutritionHabits
source: Nutrition habits: %@
tr: Beslenme alışkanlıkları: %@

# Deepseek.Error.MissingAPIKey
source: Deepseek API Key not found in environment variables. Please set DEEPSEE_API_KEY.
tr: Deepseek API Anahtarı ortam değişkenlerinde bulunamadı. Lütfen DEEPSEE_API_KEY'i ayarlayın.

# Deepseek.Error.InvalidURL
source: Invalid URL for OpenRouter API.
tr: OpenRouter API için geçersiz URL.

# Deepseek.Error.EncodingFailed
source: Failed to encode request data: %@
tr: İstek verileri kodlanamadı: %@

# Deepseek.Error.InvalidResponse
source: Invalid response from OpenRouter API. Status Code: %d, Body: %@
tr: OpenRouter API'den geçersiz yanıt. Durum Kodu: %d, Gövde: %@

# Deepseek.Error.DecodingFailed
source: Failed to decode API response: %@
tr: API yanıtı çözümlenemedi: %@

# Deepseek.Error.NoChoices
source: No choices found in the Deepseek API response.
tr: Deepseek API yanıtında herhangi bir seçim bulunamadı.

# Chatbot.Greeting
source: Hello! How can I help you today?
tr: Merhaba! Bugün size nasıl yardımcı olabilirim?

# Chatbot.Input.Placeholder
source: Type a message...
tr: Bir mesaj yazın...

# Chatbot.Title
source: Chat with AI
tr: Yapay Zeka ile Sohbet

# DepartmentSuggestion.Title
source: Which doctor should I go to?
tr: Hangi doktora gitmeliyim?

# DepartmentSuggestion.Subtitle
source: Select or write your symptoms, AI will suggest the most relevant specialty for you.
tr: Belirtilerinizi seçin veya yazın, AI sizin için en uygun uzmanlık alanını önerir.

# DepartmentSuggestion.Symptom.Headache
source: Headache
tr: Baş ağrısı

# DepartmentSuggestion.Symptom.Nausea
source: Nausea
tr: Mide bulantısı

# DepartmentSuggestion.Symptom.ChestPain
source: Chest pain
tr: Göğüs ağrısı

# DepartmentSuggestion.Symptom.Cough
source: Cough
tr: Öksürük

# DepartmentSuggestion.Symptom.SkinRash
source: Skin rash
tr: Cilt döküntüsü

# DepartmentSuggestion.Symptom.JointPain
source: Joint pain
tr: Eklem ağrısı

# DepartmentSuggestion.Symptom.Fatigue
source: Fatigue
tr: Halsizlik

# DepartmentSuggestion.Symptom.Fever
source: Fever
tr: Ateş

# DepartmentSuggestion.Other
source: Other
tr: Diğer

# DepartmentSuggestion.OtherTitle
source: Other Symptoms
tr: Diğer Belirtiler

# DepartmentSuggestion.OtherPlaceholder
source: Write additional symptoms...
tr: Ek belirtileri yazın...

# DepartmentSuggestion.FeelingsTitle
source: How do you feel?
tr: Nasıl hissediyorsunuz?

# DepartmentSuggestion.FeelingsPlaceholder
source: Describe your feelings briefly
tr: Kısaca hissiyatınızı yazın

# DepartmentSuggestion.Submit
source: Which doctor should I go to?
tr: Hangi doktora gitmeliyim?

# DepartmentSuggestion.Confidence
source: %d%% confidence
tr: %d%% güven

# DepartmentSuggestion.SystemPersona
source: You are a medical triage assistant. Based on the user's symptoms, suggest top 3 most relevant medical departments (e.g., Cardiology, Neurology, Dermatology). Respond ONLY in Turkish language.
tr: Sen bir tıbbi triyaj asistanısın. Kullanıcının belirtilerine göre en ilgili 3 tıbbi bölümü (ör. Kardiyoloji, Nöroloji, Dermatoloji) öner. Sadece Türkçe yanıt ver.

# DepartmentSuggestion.SystemFormat
source: Respond in pure JSON array with items of {"department": string, "confidence": number 0-100}. Do not include any explanation outside JSON.
tr: Cevabı sadece JSON dizisi olarak ver: {"department": string, "confidence": 0-100 sayı}. JSON dışına açıklama yazma.

# DepartmentSuggestion.UserSymptoms
source: Reported symptoms: %@
tr: Bildirilen belirtiler: %@

# DepartmentSuggestion.UserOtherSymptoms
source: Additional symptoms: %@
tr: Ek belirtiler: %@

# DepartmentSuggestion.UserFeelings
source: User feelings: %@
tr: Kullanıcı hissiyatı: %@

# DepartmentSuggestion.DefaultUserPrompt
source: No symptoms selected. Provide general triage based on common complaints.
tr: Belirti seçilmedi. Yaygın şikayetlere göre genel triay öner.

# DepartmentSuggestion.Save
source: Save to History
tr: Geçmişe Kaydet

# DepartmentSuggestion.SaveSuccess
source: Saved successfully
tr: Başarıyla kaydedildi

# DepartmentSuggestion.SaveError
source: Save failed
tr: Kaydetme başarısız

# DiseasePrediction.Title
source: What could be my disease?
tr: Hastalığım ne olabilir?

# DiseasePrediction.Subtitle
source: Select your symptoms and describe how you feel, AI will suggest possible diseases.
tr: Belirtilerinizi seçin ve nasıl hissettiğinizi açıklayın, AI olası hastalıkları önerecek.

# DiseasePrediction.Symptom.Headache
source: Headache
tr: Baş ağrısı

# DiseasePrediction.Symptom.Fever
source: Fever
tr: Ateş

# DiseasePrediction.Symptom.Cough
source: Cough
tr: Öksürük

# DiseasePrediction.Symptom.Nausea
source: Nausea
tr: Mide bulantısı

# DiseasePrediction.Symptom.Fatigue
source: Fatigue
tr: Halsizlik

# DiseasePrediction.Symptom.ChestPain
source: Chest pain
tr: Göğüs ağrısı

# DiseasePrediction.Symptom.AbdominalPain
source: Abdominal pain
tr: Karın ağrısı

# DiseasePrediction.Symptom.Dizziness
source: Dizziness
tr: Baş dönmesi

# DiseasePrediction.Other
source: Other
tr: Diğer

# DiseasePrediction.OtherTitle
source: Other Symptoms
tr: Diğer Belirtiler

# DiseasePrediction.OtherPlaceholder
source: Write additional symptoms...
tr: Ek belirtileri yazın...

# DiseasePrediction.FeelingsTitle
source: How do you feel?
tr: Nasıl hissediyorsunuz?

# DiseasePrediction.FeelingsPlaceholder
source: Describe your feelings briefly
tr: Kısaca hissiyatınızı yazın

# DiseasePrediction.DurationTitle
source: Duration
tr: Süre

# DiseasePrediction.DurationPlaceholder
source: How long have you had these symptoms?
tr: Bu belirtiler ne kadar süredir var?

# DiseasePrediction.Submit
source: What could be my disease?
tr: Hastalığım ne olabilir?

# DiseasePrediction.Confidence
source: %d%% confidence
tr: %d%% güven

# DiseasePrediction.Save
source: Save to History
tr: Geçmişe Kaydet

# DiseasePrediction.SaveSuccess
source: Saved successfully
tr: Başarıyla kaydedildi

# DiseasePrediction.SaveError
source: Save failed
tr: Kaydetme başarısız

# DiseasePrediction.SystemPersona
source: You are a medical diagnosis assistant. Based on the user's symptoms, suggest top 3 most likely diseases with brief descriptions. Respond ONLY in Turkish language.
tr: Sen bir tıbbi tanı asistanısın. Kullanıcının belirtilerine göre en olası 3 hastalığı kısa açıklamalarla öner. Sadece Türkçe yanıt ver.

# DiseasePrediction.SystemFormat
source: Respond in pure JSON array with items of {"disease": string, "confidence": number 0-100, "description": string}. Do not include any explanation outside JSON.
tr: Cevabı sadece JSON dizisi olarak ver: {"disease": string, "confidence": 0-100 sayı, "description": string}. JSON dışına açıklama yazma.

# DiseasePrediction.UserSymptoms
source: Reported symptoms: %@
tr: Bildirilen belirtiler: %@

# DiseasePrediction.UserOtherSymptoms
source: Additional symptoms: %@
tr: Ek belirtiler: %@

# DiseasePrediction.UserFeelings
source: User feelings: %@
tr: Kullanıcı hissiyatı: %@

# DiseasePrediction.UserDuration
source: Symptom duration: %@
tr: Belirti süresi: %@

# DiseasePrediction.DefaultUserPrompt
source: No symptoms selected. Provide general disease suggestions based on common complaints.
tr: Belirti seçilmedi. Yaygın şikayetlere göre genel hastalık önerileri sun.

# HomeSolution.Title
source: What can I do at home?
tr: Evde ne yapabilirim?

# HomeSolution.Subtitle
source: Describe your problem and get step-by-step home recommendations in Turkish.
tr: Şikayetinizi yazın, Türkçe ve adım adım evde öneriler alın.

# HomeSolution.InputTitle
source: Your Complaint
tr: Şikayetiniz
